{
    "characters": [
        {
            "name": "Bald Gru",
            "image": "baldgruPoster",
            "unlock": "baldozer",
            "scale": 0.55,
            "description": "\"Take gru, now make him bald\"\n\nBald gru is a celestial phenomenon, the remnants of a star gone supernova long ago. Bald Gru learned to take charge of his similarly star-birthed minon brethren, leading them to safety and success in our world. He is the head honcho. The chief of state. The one whose shoulders are bruised from carrying the whole dang fun wacky world these critter like characters live in. The fun bringer. Outside of his mech, he spans a grand 2 feet tall in height. Inside of his mech, he's uplifted to a whopping 7 ft 6in 3/4 by the mech he takes residence of,  crafted by his once celestial hands using the crashed celestial shards from his crashed celestial star.\nHis iconic movie, Indescribable You; which is not affiliated to Despicable Me, nor Gru, as these are two different characters, with this one’s name being Bald Gru; is one of much stardom and international box office success. So much so, it’s being played in the Daddy Dearest critically acclaimed movie theater in Philly before it gets interrupted and invaded by Bfcool and Gfcool by good for nothing Daddy Dearest.\nHe loves peaches, sundacing, gardening, being inspirational, fun facts, and being the baldest in the room\nHe hates fakers, Gandolfo, scams, cheats, Gandolfo, no good lying bastards, and apricots."
        },
        {
            "name": "BfCool",
            "image": "baldgruPoster",
            "scale": 0.55,
            "unlock": "baldspicable",
            "description": "\"The cool BF, the BfCool!\"\n\nThe coolest lil boyfriend around; this lil guy loves challenges and having fun! He enjoys making little songs in which to serenade and impress his girlfriend, the GFcool, but is always thwarted by her evil ass dad, Daddy Dearest! If he could, he would have all of the bacon and popsicles in the world that he could ever eat!\n\nThis little scamp wants to impress his new girlfriend this time by taking her to the dang movies! The critically acclaimed and international box office success “Indescribable You,” only to be shoved haphazardly into a portal into the iconic movie Indescribable You by her evil ahh dad, and fighting through the crazy and wacky characters that rule this little fun world of theirs.\n\nHe loves Gfcool, singing, having gosh dang wacky funnnn, relaxing, dancing, and singiinnnggg!\n\nHe HATES not having fun, Daddy Lamest, and heat/summer"
        },
        {
            "name": "GfCool",
            "image": "baldgruPoster",
            "scale": 0.55,
            "unlock": "baldspicable",
            "description": "“The cool GF, the GfCool!”\n\nThe coolest lil girlfriend around; this lil gal loves challenges and having fun! She enjoys listening to her boyfriend, BfCool, make little songs in which to serenade and impress her. She grew up in a rich, loving yet protective family, the Dearest family, where she’s nothing more than just loved. If she could, he would have all of the bacon and popsicles in the world that she could ever eat!\n\nThis little scamp is impressed by her new boyfriend since he took her to the dang movies! Her favorite movie she’s watched 23 separate times, the critically acclaimed and international box office success “Indescribable You,” only to be shoved haphazardly, and accidentally, into a portal that takes her into the iconic movie Indescribable You by her evil ass dad, and watching her bf fight through the crazy and wacky characters that rule this little fun world of theirs.\n\nShe loves BfCool, helping him, Daddest Nearest, drawing, having gosh dang wacky funnnn, relaxing, dancing, having fun, and drwaaaawinnngggg!\n\nShe HATES not having fun. And cold/winter too i guess"
        },
        {
            "name": "Daddy Dearest",
            "image": "dearest",
            "scale": 0.5,
            "unlock": "baldspicable",
            "description": "\"AHHHHHH i’m Daddy Dearest and i’m being DESCRIBED\"\n\nDaddy Dearest, the most feared, yet most successful retired rock star in the entire world, loves his beautiful daughter GfCool to da moon and back, and will do anything to make sure she’s happy and protected. That includes trying to kill the shortstack moronic brat (Daddest Deary’s words) that dares call himself her BfCool. \n\nIn an attempt to get rid of BfCool once and for all, Dundy Dearing sends him through a portal into the world of Indescribable You. The plan backfires when GfCool accidentally gets sucked in as well, forcing Dindy Darned to wait for the two of them, to escape the wonderful world of Bald Gru so that he may get his daughter back, and rid of BfCool on his own.\n\nHe loves his beautiful wife, his talented daughter, rock, music, singing, more rock, rap occasionally, money, his family\n\nHe hates incompetence, and BfCool"
        },
        {
            "name": "JT Gandolfo",
            "image": "gandorlo",
            "scale": 0.35,
            "zoom_scale": 0.1,
            "description": "\"The Dealmaker\"\n\nAnd now, JT finds himself trapped within the world of Indescribable You by Daddy Dimmest, due to his INSANELY good deals that DD just could never pass up. So, he keeps JT trapped for all of the deals he may need for his many cars. JT spends his spare time trying to sell cars to those inside of Indescribable You, though they dont get much.\n\nJohn T. Gandolfo was born July, 15th 1951 in New York City. His father moved the family to Wilmington, Delaware in 1961 to pursue his career in Human Resources. Shortly after graduating the University of Delaware, he married his wife Mary, who to this day, continues to be the cornerstone of his existence. He graduated from Villanova Law School in 1977 where he practiced law for three years as a prosecutor and another two years as a lawyer in private practice.\n\nJT’s love for the car business began during his time in law school when he sold cars at a dealership in Wilmington, Delaware to pay his way through law school. Armed with a law degree and eager to pursue his automotive career, his positions at dealerships included management, sales training, and legal advisor. JT served as head of Governor Mark Sanford's DMV task force whose overhaul was one of Mark's biggest accomplishments while in office.\n\nThat ownership opportunity came in 1990 when a corporation selected JT as a candidate to participate in their Marketing Investment Division. This was a program designed to help new dealers become established with the help of Chrysler and is how he came to own dealerships in Columbia. He worked under their guidance until 1994 when he bought out their portion of ownership and moved the dealership to its current location on Greystone Blvd. In the years following, JT opened three JD Byrider Pre-Owned Car Dealerships as well as JTs Kia of Columbia - Killian, JTs Kia of Rock Hill, and JTs AutoLand of Columbia and Lexington.\n\nHe loves deals, his Dealions\n\nHe hates not making any sales. ",
            "unlock": "dealtastic"
        },
        {
            "name": "The Minons",
            "image": "minon mondays",
            "scale": 0.5,
            "description": "\"Eyyy we’re minoning herees\"\n\nMinons, NOT Minions, are Bald Gru’s bretheren that have vowed to help him im whatever he needs, often being too lazy and just a crowd that cheers and goes rampant crazy for him. The times they are active however, they are found fighting each other or helping build whatever Bald Gru may need. \n\nThey are smaller fragments from the supernova’d star that crashed into the world and birthed Geremy and Bald Gru. They gained sentience after the star crashed, cushioning the landing of the star so Bald Gru and Geremy (the two fractured cores of the star gone supernova) could live. They grew from small amoebas to the creatures they are now, invincible yet able to kill one another.\nMinons love Bald Gru, violence, facts, fun, murder\n\nMinons hate boredom, order, and you.",
            "unlock": "baldspicable"
        },
        {
            "name": "The Dealions",
            "image": "fuckass",
            "description": "“Eghuhuehemehehehe”\n\nDealions are Gandolfo’s minions, and originate from his commercial “Dealtastic Me.” \n\nThey are dangerous and should be regarded as such. Each one has an unique personality and are corrupted in their own image. The only person capable of properly handling them is JT himself, who to them is their own father. Otherwise, they’ll attempt to distract and dismember you. Expect an evil night of evil fucked up doing.\n\nThey love meat, eating, and JT Gandolfo\n\nThey hate you",
            "unlock": "dealtastic"
        },
        {
            "name": "Ruther",
            "image": "ruther",
            "scale": 0.4,
            "unlock": "ruther_setting",
            "description": "\"https://www.youtube.com/watch?v=GSQkL9aFkNQ\"\n\nNot much is known about Ruther, rather than the fact that he seems to be an omnipresent figure that prides himself in custodial work, and taking care of the darkest corners of Bald Gru’s place. Ruther is a being that views himself in the way of Bald Gru, worshipping him to a certain extent. Being a germophobe, he vows to clean and take care of anything Bald Gru may need taken care of inside of his base; In whatever way is deemed necessary. \n\nHe’ll jingle his custodial keys in fromt of you if you aren’t paying attention. You better pay attention to the song.\n\nRuther loves cleanliness, Bald Gru, minons\n\nRuther hates not paying attention, germs"
        },
        {
            "name": "Loddy + Pico",
            "image": "loco",
            "scale": 0.5,
            "description": "“‘Tree bopped her down and she died’ sung Pico”\n\nLoco, Loddy & Pico, the power couple of the century. This story is written and made by Loddy, where the two destined lovers live in a world where Bf doesn’t exist. Pico, found himself in love with Gf, when suddenly a tree bopped her down, and she died. On a stormy winter day, Picool drank to cope with the pain and grief of the loss, before being found by Loddy, who comforted and showed him beautiful homosexual love, and religious gratification. Jingle Bald depicts their first date, where they fell in love, meeting at Loddy’s house, then going to a beautiful wintery day outside. \n\nLoddy loves Pico, facts, reddit, and religion.\n\nLoddy hates fundamentalism and toenail clippings\n\nPico loves Loddy, money, and violence.\n\nPico hates being scammed and toenail clippings",
            "unlock": "jingle-bald"
        },
        {
            "name": "Geremy",
            "image": "geremt",
            "framerate": 14.285714285714286,
            "scale": 2,
            "zoom_scale": 1,
            "description": "“Halt! It’s Yolkin’ Time”\n\nFive time WWE champion in a row, Geremy spawns from the same core of the star Bald Gru hails from. The guardian of Freeplay, the one entrusted to be the last wall of defence against the player and limitless fun, she is Bald Gru’s entrusted bodyguard/twin. Unlike the rest of the minons that love Bald Gru, she is extremely well built, independent, and has a high metabolism that pushes her to workout almost 8 days a week, to stay at the peak of her base. Her clothes, a striped red bikini top and Jorts with Bald Gru’s G on it, allow for her to flex more than usual, and allow for her limitless power to leak through.\n\nOnce you beat her, she’s seen at her stand, next to the freeplay menu selection tv to properly guide you to the songs. She also makes sure you can scroll through the credits safely, and that everything is up to working order.\n\nShe has a lot of confidence about her ability, and the impossible feats she can achieve. Did you know she once wrestled five gorilla dogs at the same time?  She’s been the one entrusted to defeat most of the defiant foes that wish harm to Bald Gru, most of which never even reach him in the first place.\n\nShe loves fun challenges, body training, working out, being protective, and her twin Bald Gru\n\nShe hates not having fun, sitting around too much, and boredom.",
            "unlock": "yolked"
        },
        {
            "name": "Martello",
            "image": "hammer",
            "scale": 0.4,
            "zoom_scale": 0.1,
            "description": "“Cool floatie little man….,,.,.”\n\nKnown worldwide as the competitive massive-cigar-chainsmoking champion, Martello is taking a moment for himself in Daddy Dearest’s pool park before being interrupted by BfCool and GfloatieCool. \n\nRegardless of his notoriety and competitive standing, Martello’s day job consists of him working as a custodian for the park. He lives in the park, most times floating in the massive Daddy-Dearest-head-shaped lazy river for picking up trash, helping passerby-ers, or those that are fucking drowning helplessly. He lost his arms to chainsmoking. \n\nHe loves chainsmoking, cigars, cigarettes, coughing, the lazy river/pools.\n\nHe hates not smoking\n\n(fun fact: Martelo is Hammer in Portuguese)",
            "unlock": "lazy-river"
        },
        {
            "name": "Sonic + Dumau",
            "image": "dumauball",
            "framerate": 20,
            "scale": 1.1,
            "zoom_scale": 0.8,
            "description": "(Sonic & Sonic Dumau)\n\n“Eu sou dumau e eu vou te COMEEERRRR”\n“WHAT ARE YOU EVEN SAYING”\n\nAfter the intense and gruelling moments of  “Mario & Sonic at the Rio 2016 Summer Olympics,” Sonic decides to visit some of the attractions and beauties of Rio de Janeiro Brazil, Christ the Redeemer. After a brief moment of peace and silence, the skies darken and the water replaced by the dark crimson of blood. As fog rolls in, a dark, mysterious figure appears within, before revealing itself to be the iconic Brazilian Sonic exe, Sonic Dumau (2016x)!\n\nSonic Dumau is a version of X who in pursuit of Sonic, became fascinated by the Brazilian culture that surrounded him. The culture overwhelmed his excitement, to the point he took it in as part of his identity, going as far as giving himself the knowledge to speak the entire language. He’s more relaxed and distracted than other exes, overtaken by the Brazilian culture that he so wishes to share with Sonic (who is reluctant of anything Dumau offers) and others within the world they’re in.\n\nSonic Dumau loves Brazil, and Sonic.\nSonic Dumau hates gringos, anyone not in his own cause\n\nSonic loves being fast, and helping others around\nSonic hates Sonic Dumau and fakers",
            "unlock": "maudade"
        },
        {
            "name": "Gorilla Dog",
            "image": "gorilladog",
            "description": "Gorilla dog a thing, but not an object.\n\nGorilla dog shows a way, but not a tool.\n\nGorilla dog shows no fear, but could be genuine.\n\nGorilla dog is life, but not forever.\n\nGorilla dog will question, but not repeat.\n\nGorilla dog will invoke, but can't foresee.\n\nGorilla dog asks “why?” But I can't answer.\n\nGorilla dog is here, yet I forget.\n\nGorilla dog will go, yet I am staying\n\nGorilla dog is temporary, yet lives for all.\n\nGorilla dog moves on, but knows to care.\n\nGorilla dog a friend, gorilla dog I love.",
            "scale": 0.8
        }
    ],
    "FORMAT_GUIDE": {
        "name":         "This is the name that shows up for the entry",
        "image":         "The image path, starting at assets/shared/images/extras/characterstuff/, looks for a .png",
        "framerate":    "Number. if this value is present it will look for a spritesheet tied to the image with an animation called 'animation' https://fpstoms.com is a good tool for this one",
        "description":  "This is the description that the entry has. If its too long to fit on the screen, the description will be scrollable. neat, right?!",
        "unlock":       "Song name that is required to have beaten, leave out of entry to not lock entry. 'ruther_setting' requires the setting to be enabled",
        "scale":        "Image scale, useful for fitting the image into the box, on image focus it will preview the image at the same scale + 25%",
        "zoom_scale":   "How much scale to be *ADDED* to the image when viewing it, if left out, defaults to 0.25",
        "video":        "Unused, was going to be a video path. Took out of the code because of strange bugs."
    }
}